{
    "Header": {
        "link-1": " About",
        "link-2": " Toolbox",
        "link-3": " Projects",
        "link-4": " Contact"
    },
    "Introduction": {
        "intro-1": "Hello, my name is",
        "intro-2": "I build web applications,",
        "intro-3": "and I am satisfied only with a beautiful solution.",
        "intro-4": "I’m a ",
        "intro-5": "Full-stack Developer",
        "intro-6": " who loves to work with modern",
        "intro-7": ". My proficiency spans the complete web development spectrum, utilizing my diverse background in both chemical engineering and full-stack programming. Currently, I’m focused on learning everything related to Full-stack Web Development.",
        "intro-8": "View my projects "
    },
    "About": {
        "title": "Why Me?",
        "about-1": "As a Chemical Engineer who has made the exciting transition into the field of software development, I can bring a unique combination of analytical thinking, problem solving skills, and a passion for creating innovative digital solutions. My engineering background has equipped me with o deep understanding of complex systems and the ability to break down challenging problems into manageable parts. As a ",
        "about-2": "self-taught",
        "about-3": " web developer, now I’m honing my technical expertise in programming languages, web development frameworks and database technologies to design and develop cutting-edge applications that meet the needs of users.",
        "about-4": "In line with my education and experience, I had the opportunity to work with different people, to take part in a team and to learn how to produce together. For this reason, I will easily adapt.",
        "about-5": "I’m passionate about learning new technologies and always looking for new opportunities to learn and grow.",
        "about-6": "When I’m not coding, I like to spend my time playing",
        "about-7": "guitar",
        "about-8": "story based video games",
        "about-9": "and gazing at the stars..."
    },
    "Toolbox": {
        "title": "Technologies I Use",
        "toolbox-2": "Languages",
        "toolbox-3": "Web scripting language",
        "toolbox-4": "Typed JavaScript superset",
        "toolbox-5": "Markup language standard",
        "toolbox-6": "Cascading style sheets",
        "toolbox-7": "JavaScript Libraries & Frameworks",
        "toolbox-8": "JavaScript library",
        "toolbox-9": "JavaScript runtime environment",
        "toolbox-10": "CSS Tools & Frameworks",
        "toolbox-11": "CSS framework",
        "toolbox-12": "React UI library",
        "toolbox-13": "CSS pre-processor",
        "toolbox-14": "Animation library",
        "toolbox-15": "Databases & Back-end Services",
        "toolbox-16": "NoSQL database",
        "toolbox-17": "SQL database",
        "toolbox-18": "Firebase alternative",
        "toolbox-19": "Development Tools",
        "toolbox-20": "TypeScript and Node.js ORM",
        "toolbox-21": "Async state management",
        "toolbox-22": "Front-end tooling",
        "toolbox-23": "Module bundler",
        "toolbox-24": "Version control system",
        "toolbox-25": "OpenAI assistant"
    },
    "Projects": {
        "title": "Some Projects I've Built",
        "project-2": "Twitter Clone",
        "project-3": "A comprehensive clone of Twitter, with a familiar interface and a range of essential features such as, profiles, tweets & replies, followings, likes & retweets, notifications and direct messaging system and, more.",
        "project-4": "A photo tagging game of PlayStation Universe. Players select a level and must find 3 hidden characters which are pre-defined. Your score is the time passed and saved when you find all 3 characters. 4 unique PlayStation levels. Leaderboards for all levels that updates in realtime.",
        "project-5": "A simple blog built with MERN stack. Headless CMS for admin, CRUD operations on mongoDB database with admin authorization, comment section for each blog post, snackbar feedback, rate limiter for users to comment and more.",
        "project-6": "Battleship",
        "project-7": "A battleship game built with pure JavaScript. Smart AI that plays similarly to a human without cheating. Ship placement supports drag and drop for better user experience. Announcer text that helps and informs you with certain situations, and more.",
        "project-8": "Load more",
        "project-9": "Other Noteworthy Projects",
        "project-10": "CV Generator",
        "project-11": "Users can create their own resume and download it in a PDF format.",
        "project-12": "Members Only",
        "project-13": "Message board with CRUD operations, user and admin model, premium user privilages.",
        "project-14": "RGBPC Components",
        "project-15": "A simple React shopping cart application with the theme of RGB lights.",
        "project-16": "A React memory game of League of Legends. The goal of the game is to avoid clicking the same champion twice.",
        "project-17": "A comprehensive To-do app created with pure JavaScript, HTML and CSS.",
        "project-18": "Weather App",
        "project-19": "Geolocation supporting weather app that gives forecast for the next 5 days, built with OpenWeatherMap API.",
        "project-20": "Interested in more? Check out my Github."
    },
    "FeaturedProject": {
        "title": "Featured Project"
    },
    "Contact": {
        "title": "What's Next?",
        "contact-2": "Name is required.",
        "contact-3": "Invalid e-mail address.",
        "contact-4": "E-mail is required.",
        "contact-5": "Message is required.",
        "contact-6": "Message sent. I'll get back to you as soon as possible.",
        "contact-7": "Something went wrong. Please try again.",
        "contact-8": "Get In Touch",
        "contact-9": "Have a question or want to work together?",
        "contact-10": "Connect with me via social media or send me an e-mail."
    }
}
