{
    "Header": {
        "link-1": " Hakkında",
        "link-2": " Teknolojiler",
        "link-3": " Projeler",
        "link-4": " İletişim"
    },
    "Introduction": {
        "intro-1": "Merhaba, benim adım",
        "intro-2": "Web uygulamaları geliştiriyorum,",
        "intro-3": "ve sadece etkileyici bir çözümle mutlu oluyorum.",
        "intro-4": "Modern ve son teknolojiye hakim olan bir ",
        "intro-5": "Full-stack",
        "intro-6": " ",
        "intro-7": " geliştiricisiyim. Kimya mühendisliği ile programlama alanındaki farklı deneyimlerimden faydalanarak geniş bir yelpazede web geliştirme yeteneklerine sahibim. Şu anda, Full-stack Web Geliştirme ile ilgili her şeyi öğrenmeye odaklanmış durumdayım.",
        "intro-8": "Projelerimi görüntüle "
    },
    "About": {
        "title": "Neden Ben?",
        "about-1": "Heyecan verici bir geçiş yaparak kimya mühendisliğinden yazılım geliştirme alanına adım atan biriyim. Analitik düşünme, problem çözme becerileri ve yenilikçi çözümler yaratma gibi benzersiz bir kombinasyon sunabilirim. Mühendislik geçmişim, karmaşık sistemlerin derin yapısını çözmüş olmama ve zor problemleri yönetilebilir parçalara ayırma yeteneği kazandırdı. Bir yazılım gelişticisi olarak ",
        "about-2": "kendimi",
        "about-3": " yetiştirdim ve şu anda programlama dilleri, web geliştirme framework'leri ve veritabanı teknolojileri konusundaki teknik uzmanlığımı geliştirerek, kullanıcıların ihtiyaçlarını karşılamayı amaçlayan uygulamalar tasarlıyor ve geliştiriyorum.",
        "about-4": "Eğitim ve deneyimimle uyumlu olarak, farklı insanlarla çalışma, bir ekip içinde yer alma ve birlikte üretme yeteneklerine sahibim. Bu yüzden kolaylıkla uyum sağlayabilirim.",
        "about-5": "Yeni teknolojileri öğrenmeye büyük bir hevesim var ve her zaman öğrenmek ve gelişmek için yeni fırsatlar arıyorum.",
        "about-6": "Çalışmadığımda, zamanımı",
        "about-7": "gitar çalarak",
        "about-8": "video oyunları oynayarak",
        "about-9": "ve yıldızlara bakarak geçirmeyi severim..."
    },
    "Toolbox": {
        "title": "Kullandığım Teknolojiler",
        "toolbox-2": "Programlama Dilleri",
        "toolbox-3": "Web script dili",
        "toolbox-4": "Type destekli JavaScript",
        "toolbox-5": "Markup dili standardı",
        "toolbox-6": "Web stil sayfaları",
        "toolbox-7": "JavaScript Kütüphaneleri & Framework'leri",
        "toolbox-8": "JavaScript kütüphanesi",
        "toolbox-9": "JavaScript çalışma ortamı",
        "toolbox-10": "CSS Araçları & Framework'leri",
        "toolbox-11": "CSS framework",
        "toolbox-12": "React UI kütüphanesi",
        "toolbox-13": "CSS önişlemci",
        "toolbox-14": "Animasyon kütüphanesi",
        "toolbox-15": "Veritabanları & Back-end Servisleri",
        "toolbox-16": "NoSQL veritabanı",
        "toolbox-17": "SQL veritabanı",
        "toolbox-18": "Firebase alternatifi",
        "toolbox-19": "Geliştirme Araçları",
        "toolbox-20": "TypeScript ve Node.js ORM",
        "toolbox-21": "Eşzamansız durum yönetimi",
        "toolbox-22": "Front-end araçları",
        "toolbox-23": "Modül paketleyici",
        "toolbox-24": "Sürüm kontrol sistemi",
        "toolbox-25": "OpenAI yardımcısı"
    },
    "Projects": {
        "title": "Geliştirdiğim Bazı Projeler",
        "project-2": "Twitter Klonu",
        "project-3": "Twitter'ın kapsamlı bir klonu, tanıdık bir arayüz ile profil, tweet ve yanıtlar, takip etme, beğenme ve retweet etme, bildirimler ve doğrudan mesajlaşma sistemi gibi birçok temel özellikler sunar.",
        "project-4": "PlayStation Evreni'nin bir fotoğraf etiketleme oyunu. Oyuncu bir seviye seçer ve önceden tanımlanmış 3 gizli karakteri bulmaya çalışır. Skorunuz, tüm 3 karakteri bulduğunuzda geçen süredir. Gerçek zamanlı olarak güncellenen tüm seviyeler için lider tabloları mevcut.",
        "project-5": "MERN stack ile oluşturulan sade bir blog. Admin için içerik yönetim sistemi (headless CMS), admin yetkilendirmesi ile mongoDB veritabanında CRUD işlemleri, her blog yazısı için yorum bölümü, snackbar geri bildirimi, kullanıcıların yorum yapması için hız sınırlayıcısı ve daha fazlası.",
        "project-6": "Amiral Battı",
        "project-7": "Saf JavaScript ile oluşturulmuş bir deniz savaşı oyunu. Hile yapmadan, insan gibi oynayan akıllı yapay zeka. Gemilerin yerleştirilmesi, kullanıcı deneyimi için sürükle & bırak özelliklerini destekler. Belirli durumlarla ilgili yardımcı olan duyurucu metinler ve daha fazlası.",
        "project-8": "Daha fazlasını göster",
        "project-9": "Diğer Projeler",
        "project-10": "CV Oluşturucu",
        "project-11": "Kullanıcılar kendi özgeçmişlerini oluşturabilir ve PDF formatında indirebilirler.",
        "project-12": "Sadece Üyelere",
        "project-13": "CRUD işlemleri, kullanıcı ve admin modeli, premium kullanıcı ayrıcalıkları olan bir mesaj panosu.",
        "project-14": "RGBPC Bileşenleri",
        "project-15": "RGB ışıklandırma temalı sade bir React alışveriş sepeti uygulaması.",
        "project-16": "League of Legends'dan esinlenilmiş bir React hafıza oyunu. Oyunun amacı aynı şampiyona ikinci kez tıklamaktan kaçınarak 30 skora erişmek.",
        "project-17": "Saf JavaScript, HTML ve CSS kullanılarak oluşturulmuş kapsamlı bir yapılacaklar (to-do) uygulaması.",
        "project-18": "Hava Durumu Uygulaması",
        "project-19": "OpenWeatherMap API ile oluşturulmuş, 5 gün sonrası için hava tahmini veren konum tabanlı hava durumu uygulaması.",
        "project-20": "Daha fazlası? Github profilime göz at."
    },
    "FeaturedProject": {
        "title": "Öne Çıkan Proje"
    },
    "Contact": {
        "title": "Sıradaki Adım Ne?",
        "contact-2": "İsim boş bırakılamaz.",
        "contact-3": "Geçersiz e-posta adresi.",
        "contact-4": "E-posta boş bırakılamaz.",
        "contact-5": "Mesaj kısmı boş bırakılamaz.",
        "contact-6": "Mesaj gönderildi. En kısa sürede size geri döneceğim.",
        "contact-7": "Bir şeyler yanlış gitti. Lütfen tekrar deneyin.",
        "contact-8": "İletişime Geçin",
        "contact-9": "Bir sorunuz var veya benimle çalışmak mı istiyorsunuz?",
        "contact-10": "Sosyal medya üzerinden iletişime geçebilir ya da bir e-posta gönderebilirsiniz.",
        "contact-11": "VEYA",
        "contact-12": "Mail Gönderin",
        "contact-13": "Bilgilerinizi bırakın ve en kısa sürede size geri döneceğim.",
        "contact-17": "Gönder"
    }
}
